src/main/resources/soap/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:soap="http://soap.web.hatef.birkle.com">
    <soapenv:Header/>
    <soapenv:Body>
        <soap:postVehiclesRequest>
            <soap:record>
                <soap:brand>Pontiac</soap:brand>
                <soap:model>Safari</soap:model>
                <soap:vehicleType>Coupe</soap:vehicleType>
                <soap:plateCountry>US</soap:plateCountry>
                <soap:plateNumber>759-JLP</soap:plateNumber>
                <soap:vin>3GYFNGEYXAS895018</soap:vin>
                <soap:creationDate>2016-10-19</soap:creationDate>
                <soap:manufacturedCountry>CZ</soap:manufacturedCountry>
            </soap:record>
            <soap:record>
                <soap:brand>Chevrolet</soap:brand>
                <soap:model>Express 1500</soap:model>
                <soap:vehicleType>Hatchback</soap:vehicleType>
                <soap:plateCountry>CZ</soap:plateCountry>
                <soap:plateNumber>423-CGP</soap:plateNumber>
                <soap:vin>KMHD35LH4FU624453</soap:vin>
                <soap:creationDate>2005-08-21</soap:creationDate>
                <soap:manufacturedCountry>DE</soap:manufacturedCountry>
            </soap:record>
            <soap:record>
                <soap:brand>Pontiac</soap:brand>
                <soap:model>Firebird</soap:model>
                <soap:vehicleType>SUV</soap:vehicleType>
                <soap:plateCountry>JP</soap:plateCountry>
                <soap:plateNumber>000-SIB</soap:plateNumber>
                <soap:vin>JTDJTUD31DD332597</soap:vin>
                <soap:creationDate>2015-01-01</soap:creationDate>
                <soap:manufacturedCountry>DE</soap:manufacturedCountry>
            </soap:record>
            <soap:record>
                <soap:brand>Isuzu</soap:brand>
                <soap:model>Trooper</soap:model>
                <soap:vehicleType>Convertible</soap:vehicleType>
                <soap:plateCountry>DE</soap:plateCountry>
                <soap:plateNumber>290-YAF</soap:plateNumber>
                <soap:vin>2B3CA7CW3AH690196</soap:vin>
                <soap:creationDate>2019-05-07</soap:creationDate>
                <soap:manufacturedCountry>DE</soap:manufacturedCountry>
            </soap:record>
            <soap:record>
                <soap:brand>Chevrolet</soap:brand>
                <soap:model>Impala</soap:model>
                <soap:vehicleType>Convertible</soap:vehicleType>
                <soap:plateCountry>US</soap:plateCountry>
                <soap:plateNumber>859-UBS</soap:plateNumber>
                <soap:vin>3N1AB6AP4BL918484</soap:vin>
                <soap:creationDate>2007-10-20</soap:creationDate>
                <soap:manufacturedCountry>CZ</soap:manufacturedCountry>
            </soap:record>
            <soap:record>
                <soap:brand>Ford</soap:brand>
                <soap:model>Crown Victoria</soap:model>
                <soap:vehicleType>MPV</soap:vehicleType>
                <soap:plateCountry>IT</soap:plateCountry>
                <soap:plateNumber>666-FDJ</soap:plateNumber>
                <soap:vin>WBAWC33547P070562</soap:vin>
                <soap:creationDate>2000-08-28</soap:creationDate>
                <soap:manufacturedCountry>KR</soap:manufacturedCountry>
            </soap:record>
            <soap:record>
                <soap:brand>Ford</soap:brand>
                <soap:model>Thunderbird</soap:model>
                <soap:vehicleType>SUV</soap:vehicleType>
                <soap:plateCountry>US</soap:plateCountry>
                <soap:plateNumber>496-JRZ</soap:plateNumber>
                <soap:vin>WAUKF68E65A898712</soap:vin>
                <soap:creationDate>2005-04-14</soap:creationDate>
                <soap:manufacturedCountry>CZ</soap:manufacturedCountry>
            </soap:record>
            <soap:record>
                <soap:brand>Morgan</soap:brand>
                <soap:model>Aero 8</soap:model>
                <soap:vehicleType>MPV</soap:vehicleType>
                <soap:plateCountry>JP</soap:plateCountry>
                <soap:plateNumber>258-TMF</soap:plateNumber>
                <soap:vin>WBAPM77569N815913</soap:vin>
                <soap:creationDate>2011-12-03</soap:creationDate>
                <soap:manufacturedCountry>IT</soap:manufacturedCountry>
            </soap:record>
            <soap:record>
                <soap:brand>Subaru</soap:brand>
                <soap:model>XT</soap:model>
                <soap:vehicleType>Sedan</soap:vehicleType>
                <soap:plateCountry>IT</soap:plateCountry>
                <soap:plateNumber>569-GQK</soap:plateNumber>
                <soap:vin>1G6DG577790647301</soap:vin>
                <soap:creationDate>2007-10-24</soap:creationDate>
                <soap:manufacturedCountry>CZ</soap:manufacturedCountry>
            </soap:record>
            <soap:record>
                <soap:brand>BMW</soap:brand>
                <soap:model>6 Series</soap:model>
                <soap:vehicleType>Hatchback</soap:vehicleType>
                <soap:plateCountry>JP</soap:plateCountry>
                <soap:plateNumber>652-YNX</soap:plateNumber>
                <soap:vin>WAUYGBFC0CN097362</soap:vin>
                <soap:creationDate>2003-05-18</soap:creationDate>
                <soap:manufacturedCountry>DE</soap:manufacturedCountry>
            </soap:record>
        </soap:postVehiclesRequest>
    </soapenv:Body>
</soapenv:Envelope>
